Performing QA on a real DPU with the example included in the docs, was able to commission a BlueField-3 DPU:

```bash
terraform apply -auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # maas_machine.dpu1 will be created
  + resource "maas_machine" "dpu1" {
      + architecture       = "arm64/generic"
      + block_devices      = (known after apply)
      + domain             = (known after apply)
      + hostname           = "DPU-0"
      + id                 = (known after apply)
      + is_dpu             = true
      + min_hwe_kernel     = "hwe-22.04"
      + network_interfaces = (known after apply)
      + pool               = (known after apply)
      + power_parameters   = (sensitive value)
      + power_type         = "redfish"
      + pxe_mac_address    = "00:11:22:33:44:55"
      + zone               = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
maas_machine.dpu1: Creating...
maas_machine.dpu1: Still creating... [00m10s elapsed]
maas_machine.dpu1: Still creating... [00m20s elapsed]
maas_machine.dpu1: Still creating... [00m30s elapsed]
...
maas_machine.dpu1: Still creating... [10m30s elapsed]
maas_machine.dpu1: Still creating... [10m40s elapsed]
maas_machine.dpu1: Creation complete after 10m43s [id=a6egfe]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
terraform plan
maas_machine.dpu1: Refreshing state... [id=a6egfe]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.
```